//  krilldan lotinga

let krill = [
    "Ч","Ё","ё","Ғ","ғ","Қ","қ","Ҳ","ҳ","Ў",
    "ў","Э","Ю","Я","Ш","Ъ","Ц","А","Б","В",
    "Г","Д","Е","Ж","З","И","Й","К","Л","М",
    "Н","О","П","Р","С","Т","У","Ф","Х","ч",
    "ц","ш","ъ","э","ю","я","а","б","в","г",
    "д","е","ж","з","и","й","к","л","м","н",
    "о","п","р","с","т","у","ф","х"
]
console.log(krill[43])
let lotin = [
    "Ch","Yo","yo","Gʻ","gʻ","Q","q","H","h",
    "Oʻ","oʻ","E","Yu","Ya","Sh","ʼ","Ts","A",
    "B","V","G","D","Y","J","Z","I","Y","K","L",
    "M","N","O","P","R","S","T","U","F","X","ch",
    "ts","sh","ʼ","e","yu","ya","a","b","v","g",
    "d","e","j","z","i","y","k","l","m","n","o",
    "p","r","s","t","u","f","x",
    
]


function to(s, o) {
    s = s.replace(/\s/g, ' ')
    let r = ""
    let [al1, al2] = o =="k" ? [ lotin, krill ]  : [ krill, lotin ]
    if(o = "k"){
        al2[43] = "e"
    }
    for (let i = 0; i < s.length; i++){
        let val = s[i];
        if( o == "k" ){
            if("CcSs".indexOf(val) != -1 && s[i+1] == "h") {
                val += "h";
                i++
            }
            if("OoGg".indexOf(val) != -1 && s[i+1] == "ʻ") {
                val += "ʻ";
                i++
            }
        } else {
             if(s[i] == "е" && s[i-1] == " ") al2[51] = "ye"
        }
        let index = al1.indexOf(val)
        r += index == -1 ? s[i] : al2[index];
    }
    return r
}
console.log(to("Men nechun sevaman Oʻzbekistonni?", "k"))
console.log(to("Мeн нeчун сeваман Ўзбeкистонни?", "l"))

let k = `Бизнес-тренерлар, мотивацион китоблар асрида яшаяпмиз. Талабалигимда бундай курсларга қатнаб, китобларни сотволиб, ўзимни камёб одам ҳисоблардим, зеро ҳали бу мавзу трендда эмас эди. Ҳозир эса ҳар куни мотивацион китоб, ҳар тешикдан янги бизнес-гуру чиқади. Бу нарса трендга айланиб кетди, миллионлаб одамни ўз домига тортиб кетди.

Шу каби тренингларда кўп бўлган, ўнлаб китоб ўқиган (ҳатто ўзи ҳам ёзиб кўрган) одам сифатида бир нарсага эътибор қаратмоқчиман. Одатда мотивация бериш учун технологик тараққиёт йўналишини ўзгартириб юборган, фавқулодда муваффақиятга эришган одамлар ҳаёти мисол келтирилади, Стив Жобс, Билл Гейтс каби.

Бундай шахсларга кўп урғу бериш ўрганувчиларни/мотивация олувчиларни боши берк кўчага киритиб қўяди. Биринчидан, ўзи бундайлар унча кўп эмас, миллионтадан битта чиқса ҳам катта гап. Ўрганувчиларнинг ҳаммаси ҳам бу даражага ета олмаслиги, афсуски, бор гап. Энг юқори маррага интилиш яхши, лекин баъзида бу кичикроқ марраларнинг қадрини тушириб юборади.

Иккинчидан, юқорида тилга олинганлар каби миллиардерлар, тарихни ўзгартириб юборганлар ҳамиша ҳам ўсишнинг яхши мисоли бўла олмайди. Уларнинг орасида кимлардир тасодиф туфайли юқори нуқтага етиб борган, кимлардир эса шунчаки керакли замонда туғилган. Қандайдир улкан технологик турткига шароит туғилаётган замонда фаолият юритган одам бу турткини амалга ошириб, тарихда қолиши эҳтимоли баландроқ; бундай эҳтиёж йўқ замонда туғилсанг, ҳеч нарса қила олмайсан.

Ёки Жобсни олайлик. Унга энг зўр таърифни Кэл Ньюпорт берган: бутун таржимаи ҳоли, қарашлари ўрганиб чиқилса, Жобсдан бизнесмен, миллиардер эмас, яхши буддизм мураббийи чиқиши керак эди. У тасодифий қарорлар туфайли тарихда қоладиган ишларни қилган.

Хоҳлаймизми, йўқми, ҳаётда барибир кўпчилик портловчи муваффақиятга эришмайди, секинлик билан ўз устида ишлаб, билим-тажрибасини ошириб, муваффақиятга эришиб боради. Муваффақиятли ҳисобланиш учун 40 млрд доллар топиш шарт эмас. Аслида миллион доллар ҳам улкан ютуқдир. Баъзида ундан ҳам камроқ пул топиб, муҳимроқ ишларни амалга ошириш мумкин.

Шунинг учун бизнес-тренерлар ва мотивацион ораторларга Жобс, Гейтсларга нисбатан камтарроқ шахсларга кўпроқ эътибор қаратишни, уларнинг ҳаётларини ўрганишни маслаҳат берган бўлардим.

Шундайлардан бири Крис Гарднер бўлади. Ўз вақтида уйсиз қолиб кетган бу одам бир амаллаб ҳаётда йўлини топиб, ўз брокерлик компаниясига асос солган. Бу компаниянинг активлари Apple активлари олдида ҳеч нарса эмас, "бор-йўғи" 60 млн доллар. Бу айни эришса бўладиган, интилса бўладиган ўрнакдир.

Крис Гарднернинг ҳаёти ҳақида Уилл Смит иштирокида зўр кино олинган: The Pursuit of Happyness (https://www.imdb.com/title/tt0454921/). Вақт бўлганда албатта кўринг.

@AsanovEldar`
console.log(to(k, "l"))
console.log(to("э", "l"))